from 臺灣言語平臺.資料組模型 import 資料組表

def 顯示全部資料組(第幾个開始,愛幾个):
	資料組陣列=[]
	for 資料組 in 資料組表.objects.order('-pk')[第幾个開始:第幾个開始+愛幾个]:
		資料結果={'編號':資料組.編號()}
		if 資料組.外語:
			資料=資料組.外語
			資料結果['類型']='外語'
			資料結果['建立時間']=資料.收錄時間
			資料結果['語言腔口']=資料.語言腔口
			資料結果['種類']=資料.種類
			資料結果['外語語言']=資料.外語語言
			資料結果['外語資料']=資料.外語資料
		elif 資料組.影音:
			資料=資料組.影音
			資料結果['類型']='影音'
			資料結果['建立時間']=資料.收錄時間
			資料結果['語言腔口']=資料.語言腔口
			資料結果['種類']=資料.種類
			資料結果['影音網址']=資料.網頁影音資料.url
		else: # 資料組.文本:
			資料=資料組.文本
			資料結果['類型']='文本'
			資料結果['建立時間']=資料.收錄時間
			資料結果['語言腔口']=資料.語言腔口
			資料結果['種類']=資料.種類
			資料結果['文本資料']=資料.文本資料
		資料組陣列.append(資料組陣列)
		
def 顯示外語資料組(第幾个開始,愛幾个):
	資料組陣列=[]
	for 資料組 in 資料組表.objects.filter(外語__isnull=False)\
			.order('-pk')[第幾个開始:第幾个開始+愛幾个]:
		資料結果={'編號':資料組.編號()}
		資料=資料組.外語
		資料結果['類型']='外語'
		資料結果['建立時間']=資料.收錄時間
		資料結果['語言腔口']=資料.語言腔口
		資料結果['種類']=資料.種類
		資料結果['外語語言']=資料.外語語言
		資料結果['外語資料']=資料.外語資料
			