Feature: 其他建議的範圍
  華語/正規化前/正規化後」用「小豬/豬仔囡/豬仔囝」
  實際上遇到的，也有可能是「對不起/拍謝/歹勢」

    Scenario: 包含全部關鍵字的華語
       Given 有人求 小豬 的講法
       And 有人答 豬仔囡 的講法
       When 有人校對 豬仔囝 的講法
       Then 查 小 會當揣著其他建議 小豬

    Scenario: 包含全部關鍵字的華語
       Given 有人求 小豬 的講法
       And 有人答 豬仔囡 的講法
       When 有人校對 豬仔囝 的講法
       Then 查 小 會當揣著其他建議 小豬

    Scenario: 完全仝款的華語應該揣著，袂使出現佇其他建議
       Given 有人求 小豬 的講法
       And 有人答 豬仔囡 的講法
       When 有人校對 豬仔囝 的講法
       Then 查 小豬 會當揣袂著其他建議 小豬

    Scenario: 關鍵字佮民眾提供的講法仝款
       Given 有人求 小豬 的講法
       And 有人答 豬仔囡 的講法
       When 有人校對 豬仔囝 的講法
       Then 查 豬仔囡 會當揣著其他建議 小豬

    Scenario: 關鍵字佮臺語提供的講法仝款
       Given 有人求 小豬 的講法
       And 有人答 豬仔囡 的講法
       When 有人校對 豬仔囝 的講法
       Then 查 豬仔囝 會當揣著其他建議 小豬
